InformationRegisters/НастройкиКадровыхРешений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКадровыхРешений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОПриемеНаРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОКадровомПереводе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОбУвольнении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьРешениеОВосстановленииВДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиКадровыхРешений/Ext/RecordSetModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 
		Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение)
		Или Не (ЭтотОбъект[0].ИспользоватьРешениеОПриемеНаРаботу
			Или ЭтотОбъект[0].ИспользоватьРешениеОКадровомПереводе
			Или ЭтотОбъект[0].ИспользоватьРешениеОбУвольнении
			Или ЭтотОбъект[0].ИспользоватьРешениеОбОтпускеПоУходуЗаРебенком
			Или ЭтотОбъект[0].ИспользоватьРешениеОВозвратеИзОтпускаПоУходуЗаРебенком
			Или ЭтотОбъект[0].ИспользоватьРешениеОВосстановленииВДолжности) Тогда
		Константы.ИспользоватьАдаптациюУвольнение.Установить(Ложь);
	КонецЕсли;
	
	ИнтеграцияУправлениеПерсоналомСобытияРасширенный.НастройкиКадровыхРешенийПриЗаписи(ЭтотОбъект, Замещение);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
